kpnair99/PIC18F97J94--All-purpose-board/Codes/PIC18F97J94_RTC/newfile.c
// PIC18F97J94 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1L
#pragma config STVREN = ON      // Stack Overflow/Underflow Reset (Enabled)
#pragma config XINST = OFF       // Extended Instruction Set (Enabled)

// CONFIG1H
#pragma config BOREN = ON       // Brown-Out Reset Enable (Controlled with SBOREN bit, disabled in Deep Sleep)
#pragma config BORV = 1         // Brown-out Reset Voltage (1.8V)
#pragma config CP0 = OFF        // Code Protect (Program memory is not code-protected)

// CONFIG2L
#pragma config FOSC = FRCDIV    // Oscillator (Fast RC Oscillator with Postscaler (FRCDIV))
#pragma config SOSCSEL = LOW    // T1OSC/SOSC Power Selection Bits (Low Power T1OSC/SOSC circuit selected)
#pragma config CLKOEN = ON      // Clock Out Enable Bit (CLKO output enabled on the RA6 pin)
#pragma config IESO = ON        // Internal External Oscillator Switch Over Mode (Enabled)

// CONFIG2H
#pragma config PLLDIV = NOPLL   // PLL Frequency Multiplier Select bits (No PLL used - PLLGO bit not available to user)

// CONFIG3L
#pragma config POSCMD = NONE    // Primary Oscillator Select (Primary oscillator disabled)
#pragma config FSCM = CSDCMD    // Clock Switching and Monitor Selection Configuration bits (Clock switching is disabled, fail safe clock monitor is disabled)

// CONFIG4L
#pragma config WPFP = WPFP255   // Write/Erase Protect Page Start/End Boundary (Write Protect Program Flash Page 255)

// CONFIG4H
#pragma config WPDIS = WPDIS    // Segment Write Protection Disable (Disabled)
#pragma config WPEND = WPENDMEM // Segment Write Protection End Page Select (Write Protect from WPFP to the last page of memory)
#pragma config WPCFG = WPCFGDIS // Write Protect Configuration Page Select (Disabled)

// CONFIG5L
#pragma config T5GSEL = T5G     // TMR5 Gate Select bit (TMR5 Gate is driven by the T5G input)
#pragma config CINASEL = DEFAULT// CxINA Gate Select bit (C1INA and C3INA are on their default pin locations)
#pragma config EASHFT = ON      // External Address Shift bit (Address Shifting enabled)
#pragma config ABW = MM         // Address Bus Width Select bits (8-bit address bus)
#pragma config BW = 16          // Data Bus Width (16-bit external bus mode)
#pragma config WAIT = OFF       // External Bus Wait (Disabled)

// CONFIG5H
#pragma config IOL1WAY = ON     // IOLOCK One-Way Set Enable bit (Once set, the IOLOCK bit cannot be cleared)
#pragma config LS48MHZ = SYSX2  // USB Low Speed Clock Select bit (Divide-by-2 (System clock must be 12 MHz))
#pragma config MSSPMSK2 = MSK7  // MSSP2 7-Bit Address Masking Mode Enable bit (7 Bit address masking mode)
#pragma config MSSPMSK1 = MSK7  // MSSP1 7-Bit Address Masking Mode Enable bit (7 Bit address masking mode)

// CONFIG6L
#pragma config WDTWIN = PS25_0  // Watch Dog Timer Window (Watch Dog Timer Window Width is 25 percent)
#pragma config WDTCLK = FRC     // Watch Dog Timer Clock Source (Use FRC when WINDIS = 0, system clock is not INTOSC/LPRC and device is not in Sleep; otherwise, use INTOSC/LPRC)
#pragma config WDTPS = 32768    // Watchdog Timer Postscale (1:32768)

// CONFIG6H
#pragma config WDTEN = SWDTDIS  // Watchdog Timer Enable (WDT enabled in hardware; SWDTEN bit disabled)
#pragma config WINDIS = WDTSTD  // Windowed Watchdog Timer Disable (Standard WDT selected; windowed WDT disabled)
#pragma config WPSA = 128       // WDT Prescaler (WDT prescaler ratio of 1:128)

// CONFIG7L
#pragma config RETEN = OFF      // Retention Voltage Regulator Control Enable (Retention not available)
#pragma config VBTBOR = ON      // VBAT BOR Enable (VBAT BOR is enabled)
#pragma config DSBOREN = ON     // Deep Sleep BOR Enable (BOR enabled in Deep Sleep)
#pragma config DSBITEN = ON     // DSEN Bit Enable bit (Deep Sleep is controlled by the register bit DSEN)

// CONFIG8L
#pragma config DSWDTPS = DSWDTPS1F// Deep Sleep Watchdog Timer Postscale Select (1:68719476736 (25.7 Days))

// CONFIG8H
#pragma config DSWDTEN = ON     // Deep Sleep Watchdog Timer Enable (DSWDT Enabled)
#pragma config DSWDTOSC = LPRC  // DSWDT Reference Clock Select (DSWDT uses LPRC as reference clock)

#include <xc.h>
#include <stdint.h>

#define _XTAL_FREQ 16000000UL

#define RTC_SLAVE_ADDR 0x6F
#define RTC_WRITE_ADDR (RTC_SLAVE_ADDR << 1)   // 0xDE
#define RTC_READ_ADDR  ((RTC_SLAVE_ADDR << 1) | 1)  // 0xDF

#define RTCSEC     0x00
#define  OSCON        0x20
#define  VBATEN       0x08
#define  START_32KHZ  0x80
uint8_t rtc_data[7];
uint8_t buffer2[10];
//
//unsigned int up;
//unsigned int u=0;

void delay_ms_(unsigned valx) {
    volatile unsigned int up;
    volatile unsigned int u = 0;
    for (u = 0; u <= valx; u++) {
        for (up = 0; up < 300; up++) {
            NOP();
        }
    }
}

void I2C_open() {
    SSP2CON1bits.SSPEN = 1;
    while (SSP2CON2bits.SEN);
}

void I2C_close() {
    SSP2CON1bits.SSPEN = 0;
}

void I2C_start() {
    SSP2CON2bits.SEN = 1;
    while (SSP2CON2bits.SEN);
}

void I2C_restart() {
    SSP2CON2bits.RSEN = 1;
    while (SSP2CON2bits.RSEN);
}

void I2C_stop() {
    SSP2CON2bits.PEN = 1;
    while (SSP2CON2bits.PEN);
}

void I2C_write_byte(uint8_t data) {
    SSP2BUF = data;
    while (!SSP2STATbits.BF);
}

uint8_t I2C_read_byte() {
    SSP2CON2bits.RCEN = 1;
    while (!SSP2STATbits.BF);
    uint8_t data = SSP2BUF;
    SSP2CON2bits.ACKDT = 0;
    SSP2CON2bits.ACKEN = 1;
    while (SSP2CON2bits.ACKEN);
    return data;
}

void RTC_SetTime(uint8_t sec) {
    I2C_start();
    delay_ms_(1);
    I2C_write_byte(RTC_WRITE_ADDR);
    delay_ms_(1);
    I2C_write_byte(RTCSEC);
    delay_ms_(1);
    I2C_write_byte(sec);
    delay_ms_(1);
    delay_ms_(20);
    I2C_stop();
    delay_ms_(20);

    I2C_start();
    delay_ms_(1);
    I2C_write_byte(RTC_WRITE_ADDR);
    delay_ms_(1);
    I2C_write_byte(0x07);
    delay_ms_(1);
    I2C_write_byte(0x08);
    delay_ms_(1);

    I2C_stop();
    delay_ms_(50);
}

//void RTC_sqw(uint8_t sec) {
//    I2C_start();
//    delay_ms_(1);
//    I2C_write_byte(RTC_WRITE_ADDR);
//    delay_ms_(1);
//    I2C_write_byte(0x00);
//    delay_ms_(1);
//    I2C_write_byte(sec);
//    delay_ms_(1);
//
//    
//}
unsigned char yp=0x0;
void RTC_ReadTimeSequential(uint8_t *buffer, uint8_t length) {
    I2C_start();
    delay_ms_(2);
    I2C_write_byte(0xDF);
    delay_ms_(2);
    I2C_write_byte(yp);
    delay_ms_(2);
    I2C_restart();
    delay_ms_(2);
    yp++;

    for (uint8_t i = 0; i < length; i++) {
        buffer2[i] = I2C_read_byte();
    }

    delay_ms_(2);
    I2C_stop();
    delay_ms_(50);
}

void main(void) {
    delay_ms_(50);

    SSP2STAT = 0x00;
    SSP2STATbits.SMP = 1;
    SSP2ADD = 0x27;
    SSP2CON1 = 0x28;
    SSP2CON2 = 0x00;
    SSP2CON1bits.SSPEN = 1;

    TRISDbits.TRISD5 = 1;
    TRISDbits.TRISD6 = 1;

    delay_ms_(20);
     I2C_start();
        delay_ms_(10);
        I2C_write_byte(0xDE);
        delay_ms_(20);
        I2C_write_byte(0x00);
        delay_ms_(20);
        I2C_write_byte(0x80);
        delay_ms_(20);
        I2C_stop();
        
        //        I2C_start();
//        delay_ms_(10);
//        I2C_write_byte(0xDE);
//        delay_ms_(20);
//        I2C_write_byte(0x07);
//        delay_ms_(20);
//        I2C_write_byte(0x40);
//        delay_ms_(20);
//        I2C_stop();
        
    while (1) {
        

       
//        


        delay_ms_(50);
        RTC_ReadTimeSequential(buffer2, 1);
        delay_ms_(20);
    }
}
